{
	"FormatVersion": 2,
	"Namespace": "",
	"Children": [
		{
			"Source":
			{
				"Text": "Choice00"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "C0794D474D21A4F6AF4994BB8A02A180"
		},
		{
			"Source":
			{
				"Text": "Choice01"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "C7CF59B34D92EE33DD6F9F931B509889"
		},
		{
			"Source":
			{
				"Text": "Choice02"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "664F68254A40E14AF01490897338E1D0"
		},
		{
			"Source":
			{
				"Text": "LOG"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "0D06BD084B3F8311AD51D1BA9F04EE93"
		},
		{
			"Source":
			{
				"Text": "MyChoice00"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "0D7DA3624F6C593CECD1A79893236209"
		},
		{
			"Source":
			{
				"Text": "MyChoice00"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "CE4F414548C42CDD41593595218917CD"
		},
		{
			"Source":
			{
				"Text": "MyChoice01"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "3CA35C7B4318DE087BF1D08A4065C884"
		},
		{
			"Source":
			{
				"Text": "MyChoice01"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "7C4F5FCC418A6EDB69CDC88D720F601C"
		},
		{
			"Source":
			{
				"Text": "MyChoice02"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "464891564E43FF7F130417998BCEA21B"
		},
		{
			"Source":
			{
				"Text": "MyChoice02"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "C9D302FC4AAEADC85C1F6E88F5ABEF7F"
		},
		{
			"Source":
			{
				"Text": "You select choice 00"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "BA1071A74F535C0514510492EBFCB489"
		},
		{
			"Source":
			{
				"Text": "You select choice 00: second event"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "50CC1B6645823BE5DBDFBCBE0D865D0C"
		},
		{
			"Source":
			{
				"Text": "You select choice 01"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "D01CCB9947325883A9CBDE989698F1FD"
		},
		{
			"Source":
			{
				"Text": "大家好！"
			},
			"Translation":
			{
				"Text": "Hello everybody!"
			},
			"Key": "8BDD4B6A4BA8FB842C9EF0A0688BCE63"
		}
	],
	"Subnamespaces": [
		{
			"Namespace": "Chapter1-1",
			"Children": [
				{
					"Source":
					{
						"Text": "由於這個Plugin會用到HorizonUI Plugin、HorizonTween Plugin跟HorizonFramework Plugin中的功能，因此在開始使用這個Plugin之前，先去了解相依的三個Plugin怎麼使用，將能夠幫助我們更快的理解這個Plugin的各項功能該怎麼使用。"
					},
					"Translation":
					{
						"Text": "Because this plugin"
					},
					"Key": "id_002_DialogueText"
				},
				{
					"Source":
					{
						"Text": "這個demo專案會展示HorizonDialogue Plugin內的一些主要的功能。"
					},
					"Translation":
					{
						"Text": "This demo project will demonstrate major functions of HorizonDialogue plugin."
					},
					"Key": "id_001_DialogueText"
				},
				{
					"Source":
					{
						"Text": "那麼，讓我們來看看這個Plugin能夠做到那些事吧！"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "id_003_DialogueText"
				}
			]
		},
		{
			"Namespace": "Chapter1-2",
			"Children": [
				{
					"Source":
					{
						"Text": " First is CreateEventDialogueMsg, which has few param but easier to add. It will try to find HorizonDialogueMsgTextBlock using \"DefaultDialogueMsgTextBlockWidgetName\" that you can set in the DialogueScene."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "id_005_DialogueText"
				},
				{
					"Source":
					{
						"Text": "Hello! 有人在嗎？"
					},
					"Translation":
					{
						"Text": "Hello! Anyone here?"
					},
					"Key": "id_001_DialogueText"
				},
				{
					"Source":
					{
						"Text": "There are two kinds of DialogueMsg Event. "
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "id_004_DialogueText"
				},
				{
					"Source":
					{
						"Text": "This tutorial will show you how to add dialogue events in DialogueScene."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "id_003_DialogueText"
				},
				{
					"Source":
					{
						"Text": "你是來學"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "id_002_DialogueText"
				},
				{
					"Source":
					{
						"Text": "教學一：基本用法"
					},
					"Translation":
					{
						"Text": "Tutorial 1: Basic Usage"
					},
					"Key": "id_chapter_title_DialogueText"
				}
			]
		},
		{
			"Namespace": "ChapterTest",
			"Children": [
				{
					"Source":
					{
						"Text": "測試：Widget"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "id_chapter_title_DialogueText"
				}
			]
		},
		{
			"Namespace": "DialogueTalkerName",
			"Children": [
				{
					"Source":
					{
						"Text": "企畫"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "id_designer_DialogueTalkerName"
				},
				{
					"Source":
					{
						"Text": "程式"
					},
					"Translation":
					{
						"Text": "Programmer"
					},
					"Key": "id_programmer_DialogueTalkerName"
				},
				{
					"Source":
					{
						"Text": "美術"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "id_artist_DialogueTalkerName"
				}
			]
		}
	]
}